In [1]:
import requests 
import json
import os
from dotenv import load_dotenv
import pandas as pd
from pandas import json_normalize
import time
load_dotenv()
import requests
from bs4 import BeautifulSoup

In [2]:
#carga stone_enriquecido
Stones_Last = pd.read_csv("../data/stone_500_rich.csv")
Stones_Last.drop(["Unnamed: 0"], axis = 1, inplace = True)
Stones_Last.sample(3)

,Number,Year,Album,Artist,Gen,Subgen,playcount,listeners
422,423,2001,Anthology,Diana Ross & The Supremes,Electronic,Pop Rock,52989,22530
376,377,1991,The Ultimate Collection: 1948-1990,John Lee Hooker,Blues,Country Blues,9360,316
252,253,1980,The River,Bruce Springsteen,Rock,Folk Rock,3559610,240243

In [3]:
Spotify_500 = pd.read_csv("../data/Spotify_500.csv")
Spotify_500.drop(["Unnamed: 0"], axis = 1, inplace = True)
Spotify_500.sample(3)

     Rank      Artist                  Album       Total    Daily
494   495      Avicii                    TIM  1295586306   450056
373   374  Conan Gray               Kid Krow  1544432430  1873959
167   168    Coldplay  A Head Full of Dreams  2428109841   996055

In [4]:
top50_lastfm = pd.read_csv("../data/top50_lastfm.csv")
top50_lastfm.drop(["Unnamed: 0"], axis = 1, inplace = True)
top50_lastfm.sample(3)

        name  playcount  listeners
35   Nirvana  266004482    4833744
40  Paramore  227167270    3031441
24  Gorillaz  221756686    4183547

In [5]:
top_sells = pd.read_csv("../data/top_sells.csv")
top_sells.drop(["Unnamed: 0"], axis = 1, inplace = True)
top_sells.sample(3)

    Rank         Artist              Title  Millions
28    22     Metallica           Metallica        16
4     46   Def Leppard            Hysteria        12
29    21  Led Zeppelin   Physical Graffiti        16

In [6]:
top_sells_rich = pd.read_csv("../data/top_sells_rich.csv")
top_sells_rich.drop(["Unnamed: 0"], axis = 1, inplace = True)
top_sells_rich.sample(3)

,Rank,Artist,Title,playcount,listeners
19,31,Britney Spears,...Baby One More Time,5053151,264526
28,22,Metallica,Metallica,32895695,1440912
44,6,Billy Joel,Greatest Hits Volume 1 & Volume 2,27932,2043